In [1]:
import pandas as pd

In [5]:
dados = {'A': pd.Series([15, 17, 12], index = ['w', 'k', 'z']),
        'B': pd.Series([11, 21, 29, 33], index = ['w', 'k', 'z', 'y']),
        'C': pd.Series([1, 14, 27, 33], index = ['w', 'k', 'z', 'y']),
        'D': pd.Series([101, 22, 33], index = ['k', 'z', 'y'])}
df = pd.DataFrame(dados)

In [6]:
df

      A   B   C      D
k  17.0  21  14  101.0
w  15.0  11   1    NaN
y   NaN  33  33   33.0
z  12.0  29  27   22.0

Acessando o valor 15 da coluna A

In [7]:
df.at['w', 'A']

15.0

In [8]:
df.iat[1, 0]

15.0

In [9]:
df

      A   B   C      D
k  17.0  21  14  101.0
w  15.0  11   1    NaN
y   NaN  33  33   33.0
z  12.0  29  27   22.0

Acessando o Valor 33 da coluna C:

In [10]:
df.at['y', 'C']

33

In [11]:
df.iat[2,2]

33

# Mudando Valores

Coluna A

In [12]:
df

      A   B   C      D
k  17.0  21  14  101.0
w  15.0  11   1    NaN
y   NaN  33  33   33.0
z  12.0  29  27   22.0

In [13]:
df.at['y', 'A'] = 21

In [14]:
df

      A   B   C      D
k  17.0  21  14  101.0
w  15.0  11   1    NaN
y  21.0  33  33   33.0
z  12.0  29  27   22.0

Coluna D:

In [15]:
df.iat[1, 3] = 130

In [16]:
df

      A   B   C      D
k  17.0  21  14  101.0
w  15.0  11   1  130.0
y  21.0  33  33   33.0
z  12.0  29  27   22.0

In [17]:
df.ndim

2

In [18]:
df.shape

(4, 4)

In [19]:
df.size

16